src/cf/Catalogs/ЦелиПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>ЦелиПроекта</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Проекты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Обоснование</Name>
					<Comment>Почему важно достичь цель</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Достигнута</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КритерииДостижения</Name>
					<Comment>Как понять что цель достигнура</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Критерий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выполнен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ПользовательскиеИстории.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>ПользовательскиеИстории</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ЦелиПроекта</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючевоеДействие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеобходимыйФункционал</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ценность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Метрики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Метрики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БизнесВес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяFeatureФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерIssue</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ЦелиПроекта/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ОбщегоНазначениеКлиент.УбратьСКонцовПробелы(Объект.Наименование);
	
	СоздатьКаталогЦели();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКаталогЦели()
	КаталогПроекта = ОбщегоНазначениеСервер.ПолучитьКаталогПроекта(Объект.Владелец);
	
	ИмяКаталога = КаталогПроекта + "\features\" +  Объект.Наименование;
	
	НачатьСозданиеКаталога(Новый ОписаниеОповещения("СозданиеКаталогаЦелиЗавершение", ЭтотОбъект), ИмяКаталога);
КонецПроцедуры

&НаКлиенте
Процедура СозданиеКаталогаЦелиЗавершение(ИмяКаталога, ДополнительныеПараметры) Экспорт
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Создан каталог цели";
	Сообщение.Сообщить();	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВCSV(Команда)
	Адрес = "";
	
	ВыгрузитьВCSVНаСервере(Адрес);
	
	Если Не ПустаяСтрока(Адрес) Тогда
		ПолучитьФайл(Адрес, Объект.Наименование + ".csv");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьВCSVНаСервере(Адрес) 
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(".csv");
	
	ВыполнитьВыгрузитьВCSV(ИмяВременногоФайла);

	Файл = Новый Файл(ИмяВременногоФайла);
	Если Файл.Существует() Тогда
		ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
		Адрес = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
		УдалитьФайлы(ИмяВременногоФайла);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВыполнитьВыгрузитьВCSV(ИмяВременногоФайла)
	Писатель = Новый ЗаписьТекста(ИмяВременногоФайла, КодировкаТекста.UTF8);

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПользовательскиеИстории.Владелец.Наименование КАК ЦельПроекта,
	|	ПользовательскиеИстории.Наименование КАК Заголовок,
	|	ПользовательскиеИстории.Роль,
	|	ПользовательскиеИстории.КлючевоеДействие,
	|	ПользовательскиеИстории.НеобходимыйФункционал
	|ИЗ
	|	Справочник.ПользовательскиеИстории КАК ПользовательскиеИстории
	|ГДЕ
	|	ПользовательскиеИстории.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;

	Писатель.ЗаписатьСтроку("ЦельПроекта,Заголовок,Роль,КлючевоеДействие,НеобходимыйФункционал");

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = "";
		
		НоваяСтрока = НоваяСтрока + ","  + ОбщегоНазначениеСервер.ОбернутьВКавычки(ВыборкаДетальныеЗаписи.ЦельПроекта);
		НоваяСтрока = НоваяСтрока + ","  + ОбщегоНазначениеСервер.ОбернутьВКавычки(ВыборкаДетальныеЗаписи.Заголовок);
		НоваяСтрока = НоваяСтрока + ","  + ОбщегоНазначениеСервер.ОбернутьВКавычки(ВыборкаДетальныеЗаписи.Роль);
		НоваяСтрока = НоваяСтрока + ","  + ОбщегоНазначениеСервер.ОбернутьВКавычки(ВыборкаДетальныеЗаписи.КлючевоеДействие);
		НоваяСтрока = НоваяСтрока + ","  + ОбщегоНазначениеСервер.ОбернутьВКавычки(ВыборкаДетальныеЗаписи.НеобходимыйФункционал);

		НоваяСтрока = Сред(НоваяСтрока, 2);
		
		Писатель.ЗаписатьСтроку(НоваяСтрока);
	КонецЦикла;

	Писатель.Закрыть();
КонецПроцедуры
